---
title: AdvancedLayered
classe: Autodesk.Revit.DB.Visual.AdvancedLayered
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 16
---

# AdvancedLayered

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String LayeredAnisotropy { get; }` | `AdvancedLayered.LayeredAnisotropy` | String |
| `String LayeredBottomF0 { get; }` | `AdvancedLayered.LayeredBottomF0` | String |
| `String LayeredDiffuse { get; }` | `AdvancedLayered.LayeredDiffuse` | String |
| `String LayeredF0 { get; }` | `AdvancedLayered.LayeredF0` | String |
| `String LayeredFraction { get; }` | `AdvancedLayered.LayeredFraction` | String |
| `String LayeredNdfType { get; }` | `AdvancedLayered.LayeredNdfType` | String |
| `String LayeredNormal { get; }` | `AdvancedLayered.LayeredNormal` | String |
| `String LayeredRotation { get; }` | `AdvancedLayered.LayeredRotation` | String |
| `String LayeredRoughness { get; }` | `AdvancedLayered.LayeredRoughness` | String |
| `String SurfaceAlbedo { get; }` | `AdvancedLayered.SurfaceAlbedo` | String |
| `String SurfaceAnisotropy { get; }` | `AdvancedLayered.SurfaceAnisotropy` | String |
| `String SurfaceCutout { get; }` | `AdvancedLayered.SurfaceCutout` | String |
| `String SurfaceNdfType { get; }` | `AdvancedLayered.SurfaceNdfType` | String |
| `String SurfaceNormal { get; }` | `AdvancedLayered.SurfaceNormal` | String |
| `String SurfaceRotation { get; }` | `AdvancedLayered.SurfaceRotation` | String |
| `String SurfaceRoughness { get; }` | `AdvancedLayered.SurfaceRoughness` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```